; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v4 ?v1)
		(pred_2 ?v3)
		(pred_1 ?v5)
		(pred_4 ?v5)
		(pred_6 ?v3 ?v5)
		(pred_5)
		(pred_3 ?v3))

   (:action op_2
       :parameters  (?v7 ?v8)
       :precondition (and (not-eq ?v7 ?v8) 
                          (pred_1 ?v7) (pred_1 ?v8) (pred_4 ?v7))
       :effect (and  (pred_4 ?v8)
		     (not (pred_4 ?v7))))


   (:action op_1
       :parameters (?v6 ?v2)
       :precondition  (and  (pred_2 ?v6) (pred_1 ?v2)
			    (pred_6 ?v6 ?v2) (pred_4 ?v2) (pred_5))
       :effect (and (pred_3 ?v6)
		    (not (pred_6 ?v6 ?v2)) 
		    (not (pred_5))))

   (:action op_3
       :parameters  (?v6  ?v2)
       :precondition  (and  (pred_2 ?v6) (pred_1 ?v2)
			    (pred_3 ?v6) (pred_4 ?v2))
       :effect (and (pred_6 ?v6 ?v2)
		    (pred_5)
		    (not (pred_3 ?v6)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_06 obj_01 obj_09 obj_04 obj_02 obj_07 
          obj_08 obj_05 obj_03 
)
(:init
(pred_1 obj_06)
(pred_1 obj_01)
(pred_1 obj_09)
(pred_1 obj_04)
(pred_1 obj_02)
(pred_1 obj_07)
(pred_2 obj_08)
(pred_2 obj_05)
(pred_2 obj_03)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_09)
(not-eq obj_09 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_01 obj_09)
(not-eq obj_09 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_09 obj_04)
(not-eq obj_04 obj_09)
(not-eq obj_09 obj_02)
(not-eq obj_02 obj_09)
(not-eq obj_09 obj_07)
(not-eq obj_07 obj_09)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_02)
(pred_5)
(pred_6 obj_08 obj_04)
(pred_6 obj_05 obj_06)
(pred_6 obj_03 obj_04)
(pred_4 obj_04)
)
(:goal
(and
(pred_6 obj_08 obj_04)
(pred_6 obj_05 obj_04)
(pred_6 obj_03 obj_04)
)
)

(:constraints
  (sometime-before  (pred_6 obj_05 obj_04) (pred_4 obj_01))
)
)

; plan
1. (op_1 obj_08 obj_04)
   deleted: (pred_6 obj_08 obj_04) (pred_5)
   added: (pred_3 obj_08)
   goals met: 1 of 3
2. (op_2 obj_04 obj_01)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_01)
   goals met: 1 of 3
3. (op_3 obj_08 obj_01)
   deleted: (pred_3 obj_08)
   added: (pred_6 obj_08 obj_01) (pred_5)
   goals met: 1 of 3
4. (op_2 obj_01 obj_06)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_06)
   goals met: 1 of 3
5. (op_1 obj_05 obj_06)
   deleted: (pred_6 obj_05 obj_06) (pred_5)
   added: (pred_3 obj_05)
   goals met: 1 of 3
6. (op_2 obj_06 obj_04)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_04)
   goals met: 1 of 3
7. (op_3 obj_05 obj_04)
   deleted: (pred_3 obj_05)
   added: (pred_6 obj_05 obj_04) (pred_5)
   goals met: 2 of 3
8. (op_2 obj_04 obj_01)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_01)
   goals met: 2 of 3
9. (op_1 obj_08 obj_01)
   deleted: (pred_6 obj_08 obj_01) (pred_5)
   added: (pred_3 obj_08)
   goals met: 2 of 3
10. (op_2 obj_01 obj_04)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_04)
   goals met: 2 of 3
11. (op_3 obj_08 obj_04)
   deleted: (pred_3 obj_08)
   added: (pred_6 obj_08 obj_04) (pred_5)
   goals met: 3 of 3
